In [1]:
#Dependencies
import pandas as pd
import numpy as np

In [2]:
#Import CSV File
nr_2017_sta_path = "Input_Data/Nice_Ride_2017_station_locations.csv"
nr_2017_trip_path = "Input_Data/Nice_ride_trip_history_2017_season.csv"

In [3]:
#Read data to df
station_17 = pd.read_csv(nr_2017_sta_path, dtype={"Terminal":int, "Station":str, "Latitude":float, "Longitude":float, "NbDocks":int, "Notes":str})
station_17.head()

  Number                            Name   Latitude  Longitude  Total docks
0  30000              100 Main Street SE  44.984892 -93.256551           27
1  30001        25th Street & 33rd Ave S  44.957341 -93.223374           15
2  30002      Riverside Ave & 23rd Ave S  44.967115 -93.240149           15
3  30003  Plymouth Ave N &  N Oliver Ave  44.991412 -93.306269           15
4  30004          11th Street & Hennepin  44.975340 -93.278690           23

In [4]:
len(station_17)

202

In [5]:
trip_17 = pd.read_csv(nr_2017_trip_path, dtype={"Start date":str, "Start station":str, "Start station number":str, "End date":str, "End station":str, "End station number":str, "Total duration (Seconds)":int, "Account type":str})
trip_17.head()

,Start date,Start station,Start station number,End date,End station,End station number,Account type,Total duration (Seconds)
0,11/5/2017 21:45,Hennepin Ave & S Washington Ave,30184,11/5/2017 22:02,Logan Park,30104,Member,1048
1,11/5/2017 21:45,Broadway Street N & 4th Street E,30122,11/5/2017 22:26,Broadway Street N & 4th Street E,30122,Member,2513
2,11/5/2017 21:43,Dale Street & Grand Ave.,30106,11/5/2017 22:13,N Milton Street & Summit Ave,30101,Member,1817
3,11/5/2017 21:41,Weisman Art Museum,30183,11/5/2017 22:05,22nd Ave S & Franklin Ave,30014,Casual,1399
4,11/5/2017 21:38,South 2nd Street & 3rd Ave S,30030,11/5/2017 21:44,6th Ave SE & University Ave,30088,Member,370

In [6]:
len(trip_17)

460718